dafoam-tutorials-main/Prowim_Wing_Propeller/system/decomposeParDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains     2;

method                 scotch;

simpleCoeffs 
{ 
    n                  (2 2 1);
    delta              0.001;
} 

distributed            false;

roots();

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
